In [1]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [2]:
# Read the CSV files into DataFrames.
df_2020 = pd.read_csv('Resources/athletic_sales_2020.csv')
df_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [3]:
# Display the 2020 sales DataFrame
df_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [4]:
# Display the 2021 sales DataFrame
df_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [5]:
# Check the 2020 sales data types.
df_2020.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [6]:
# Check the 2021 sales data types.
df_2021.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [8]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
df_2020_2021_combine = pd.concat([df_2020, df_2020_2021_combine], axis='rows', join='inner' )
df_2020_2021_combine = df_2020_2021_combine.reset_index(drop=True)
df_2020_2021_combine

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
10935,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
10936,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
10937,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
10938,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
10939,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

In [9]:
# Check if any values are null.
df_2020_2021_combine.isnull().sum() # Any num > 0 means there are null data

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [10]:
# Check the data type of each column
df_2020_2021_combine.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [11]:
# Convert the "invoice_date" to a datetime datatype
df_2020_2021_combine['invoice_date'] = pd.to_datetime(df_2020_2021_combine['invoice_date'])

/var/folders/z1/fwm2z81s3613vfkl48mnzyx80000gn/T/ipykernel_23684/3011048009.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_2020_2021_combine['invoice_date'] = pd.to_datetime(df_2020_2021_combine['invoice_date'])

In [12]:
# Confirm that the "invoice_date" data type has been changed.
df_2020_2021_combine.dtypes

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [13]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
df_group = df_2020_2021_combine.groupby(['region', 'state', 'city'])[['units_sold']].agg('sum')
df_group = df_group.rename(columns={'units_sold':'Total_Products_Sold'})

# Show the top 5 results.
df_group.sort_values('Total_Products_Sold', ascending=False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    223908
South     Texas      Houston                     180644
Southeast Florida    Miami                       146270
West      California San Francisco               107279
          Nevada     Las Vegas                   103662

#### Using `pivot_table`

In [15]:
# Show the number products sold for region, state, and city.
df_pivot_table = pd.pivot_table(df_2020_2021_combine, index=['region', 'state', 'city'], values='units_sold', aggfunc='sum')


# Rename the "units_sold" column to "Total_Products_Sold"
df_pivot_table = df_pivot_table.rename(columns={'units_sold':'Total_Products_Sold'})


# Show the top 5 results.
df_pivot_table.sort_values('Total_Products_Sold', ascending=False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    223908
South     Texas      Houston                     180644
Southeast Florida    Miami                       146270
West      California San Francisco               107279
          Nevada     Las Vegas                   103662

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [17]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
df_group = df_2020_2021_combine.groupby(['region', 'state', 'city'])[['total_sales']].agg('sum')
df_group = df_group.rename(columns={'total_sales':'Total Sales'})

# Show the top 5 results.
df_group.sort_values('Total Sales', ascending=False).head()

                                    Total Sales
region    state      city
Northeast New York   New York          79602470
Southeast Florida    Miami             63201726
West      Washington Seattle           52661436
South     Texas      Houston           50913764
West      California San Francisco     42116626

#### Using `pivot_table`

In [19]:
# Show the total sales for the products sold for each region, state, and city.
df_pivot = pd.pivot_table(df_2020_2021_combine, index=['region', 'state', 'city'], values='total_sales', aggfunc='sum')


# Optional: Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.
df_pivot.sort_values('total_sales', ascending=False).head()

                                    total_sales
region    state      city
Northeast New York   New York          79602470
Southeast Florida    Miami             63201726
West      Washington Seattle           52661436
South     Texas      Houston           50913764
West      California San Francisco     42116626

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [21]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
df_group = df_2020_2021_combine.groupby(['retailer', 'region', 'state', 'city'])[['total_sales']].agg('sum')
df_group = df_group.rename(columns={'total_sales':'Total Sales'})
# Show the top 5 results.
df_group.sort_values('Total Sales', ascending=False).head()

                                                Total Sales
retailer    region    state      city
Foot Locker Northeast New York   New York          50017136
West Gear   West      Washington Seattle           49725350
                      Colorado   Denver            41993072
                      Nevada     Las Vegas         41717018
                      California San Francisco     40937803

#### Using `pivot_table`

In [22]:
# Show the total sales for the products sold for each retailer, region, state, and city.
df_pivot = pd.pivot_table(df_2020_2021_combine, index=['retailer', 'region', 'state', 'city'], values='total_sales', aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.
df_pivot.sort_values('total_sales', ascending=False).head()

                                                total_sales
retailer    region    state      city
Foot Locker Northeast New York   New York          50017136
West Gear   West      Washington Seattle           49725350
                      Colorado   Denver            41993072
                      Nevada     Las Vegas         41717018
                      California San Francisco     40937803

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [23]:
# Filter the sales data to get the women's athletic footwear sales data.
df_womens_sales = df_2020_2021_combine.loc[df_2020_2021_combine['product'] == "Women's Athletic Footwear"]
df_womens_sales.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

#### Using `groupby`

In [25]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
df_group = df_womens_sales.groupby(['retailer', 'region', 'state', 'city'])[['units_sold']].agg('sum')
df_group = df_group.rename(columns={'units_sold':"Women's_Footwear_Units_Sold"})
# Show the top 5 results.
df_group.sort_values("Women's_Footwear_Units_Sold", ascending=False).head()

                                                Women's_Footwear_Units_Sold
retailer    region    state      city
Foot Locker Northeast New York   New York                             21992
Walmart     South     Texas      Houston                              17432
West Gear   West      California San Francisco                        15001
                      Nevada     Las Vegas                            14154
                      Washington Seattle                              11618

#### Using `pivot_table`

In [29]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
df_pivot_table = pd.pivot_table(df_womens_sales, index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum')


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
df_pivot_table = df_pivot_table.rename(columns={'units_sold':'Womens_Footwear_Units_Sold'})


# Show the top 5 results.
df_pivot_table.sort_values('Womens_Footwear_Units_Sold', ascending=False).head()

                                                Womens_Footwear_Units_Sold
retailer    region    state      city
Foot Locker Northeast New York   New York                            21992
Walmart     South     Texas      Houston                             17432
West Gear   West      California San Francisco                       15001
                      Nevada     Las Vegas                           14154
                      Washington Seattle                             11618

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [30]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
df_days = pd.pivot_table(df_womens_sales, index='invoice_date', values='total_sales', aggfunc='sum')


# Optional: Rename the "total_sales" column to "Total Sales"


# Show the table.
df_days

              total_sales
invoice_date
2020-01-04         805486
2020-01-05         283602
2020-01-11         259112
2020-01-17         346026
2020-01-22         776500
...                   ...
2021-12-22         200406
2021-12-23         808022
2021-12-24         190885
2021-12-25         315175
2021-12-30         167903

[355 rows x 1 columns]

In [32]:
# Resample the pivot table into daily bins, and get the total sales for each day.
df_daily_bin = df_days.resample('D').sum()


# Sort the resampled pivot table in ascending order on "Total Sales".
df_daily_bin.sort_values('total_sales', ascending=False).head(10)

              total_sales
invoice_date
2021-07-16        1521825
2020-09-14        1507006
2021-12-16        1473497
2020-09-08        1452212
2020-08-03        1406092
2021-06-17        1376988
2020-04-24        1251514
2020-08-15        1142776
2020-08-21        1141704
2020-07-28        1106622

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [34]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
df_weekly_bin = df_days.resample('W').sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
df_weekly_bin.sort_values('total_sales', ascending=False).head(10)

              total_sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2020-04-26        2830956
2021-07-18        2801449
2021-11-14        2531721
2020-08-09        2503056
2021-08-22        2491259
2021-08-15        2463941
2021-11-21        2449537